aula2/app/controllers/departamentos_controller.rb

  def index
    @departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

  def create
    @departamento = Departamento.new(departamento_params)

    respond_to do |format|
      if @departamento.save
---
INSERT INTO "departamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Veículos"], ["created_at", "2018-09-21 17:28:24.993097"], ["updated_at", "2018-09-21 17:28:24.993097"]]

    def set_departamento
      @departamento = Departamento.find(params[:id])
---
SELECT  "departamentos".* FROM "departamentos" WHERE "departamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]