aula2/app/controllers/produtos_controller.rb

    def index
        @produtos = Produto.order(nome: :asc).limit 6
        @produto_com_desconto = Produto.order(:preco).limit 1
---
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC LIMIT ?  [["LIMIT", 2]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]

    def create
        valores = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade, :departamento_id)
        @produto = Produto.new valores
        if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Produto com departamento"], ["descricao", "Breve"], ["preco", 1000.0], ["quantidade", 10], ["created_at", "2018-09-21 19:02:41.416833"], ["updated_at", "2018-09-21 19:02:41.416833"]]

    def busca
        @nome = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like 'Tv')