aula5/app/controllers/departamentos_controller.rb

SELECT "departamentos".* FROM "departamentos"
---
  def index
    @departamentos = Departamento.all

SELECT "produtos".* FROM "produtos" WHERE (departamento_id = '1')
---
  def show
    @produtos_por_departamento = Produto.where("departamento_id = ?", params[:id])

INSERT INTO "departamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Veículos"], ["created_at", "2018-09-21 17:28:24.993097"], ["updated_at", "2018-09-21 17:28:24.993097"]]
---
  def create
    @departamento = Departamento.new(departamento_params)

    respond_to do |format|
      if @departamento.save

SELECT  "departamentos".* FROM "departamentos" WHERE "departamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_departamento
      @departamento = Departamento.find(params[:id])