aula3/app/controllers/produtos_controller.rb

    def index
        @produtos = Produto.order(nome: :asc).limit 6
        @produto_com_desconto = Produto.order(:preco).limit 1
---
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC LIMIT ?  [["LIMIT", 2]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]

    def update
        if @produto.update produto_params
---
UPDATE "produtos" SET "descricao" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["descricao", "exclui por favor mano"], ["updated_at", "2018-09-21 22:36:33.940719"], ["id", 34]]

    def create
        @produto = Produto.new produto_params
        if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at", "departamento_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    def busca
        @nome = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like 'Tv')