aula4/app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC LIMIT ?  [["LIMIT", 2]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @produtos = Produto.order(nome: :asc).limit 6
        @produto_com_desconto = Produto.order(:preco).limit 1

UPDATE "produtos" SET "nome" = ?, "preco" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Produto novo 2.0"], ["preco", 1000.0], ["updated_at", "2018-09-24 21:31:56.838937"], ["id", 39]]
---
    def update
        if @produto.update produto_params

INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at", "departamento_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @produto = Produto.new produto_params
        if @produto.save

SELECT "produtos".* FROM "produtos" WHERE (nome like 'Tv')
---
    def busca
        @nome = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome}%"